/******************************************************************************
* @file    timer.c
* @author  xxc
* @version V1.0
* @date    2020-12-15
* @brief   使用STC工具计算，1T定时器
*
******************************************************************************
* @attention
*
*******************************************************************************/ 

#include "Timer.h"   
#include "sysclk.h"   




/**
  * @brief  1毫秒@24.000MHz
  * @param  None
  * @retval None
  */
void timer0SetforInt(void)	
{


}


/**
  * @brief  TimeBase时钟配置fTB
  * @param  None
  * @retval None
  */
void timerbaseInit(void)
{
	_tbck = 1;  //TBC:Bit6: fTB=fSYS/4, 8/4=2Mhz
	/* 	fTB = 2000000hz
		TB11~TB10
		00：4096  / 2000000hz = 0.002048s
		01: 8192  / 2000000hz = 0.004096s
		10: 16384 / 2000000hz = 0.008192s
		11: 32768 / 2000000hz = 0.016384s
		TB02~TB00
		000：256   / 2000000hz = 0.000128s
		001: 512   / 2000000hz = 0.000256s
		010: 1024  / 2000000hz = 0.000512s
		011: 2048  / 2000000hz = 0.001024s
	*/
	// _tbc = 



}









